{
  "alignment": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the alignment"
    },
    {
      "column_name": "alignment",
      "column_description": "the alignment of the superhero",
      "value_description": "commonsense evidence: Alignment refers to a character's moral and ethical stance and can be used to describe the overall attitude or behavior of a superhero. Some common alignments for superheroes include: Good: These superheroes are typically kind, selfless, and dedicated to protecting others and upholding justice. Examples of good alignments include Superman, Wonder Woman, and Spider-Man. Neutral: These superheroes may not always prioritize the greater good, but they are not necessarily evil either. They may act in their own self-interest or make decisions based on their own moral code. Examples of neutral alignments include the Hulk and Deadpool.  Bad: These superheroes are typically selfish, manipulative, and willing to harm others in pursuit of their own goals. Examples of evil alignments include Lex Luthor and the Joker."
    }
  ],
  "attribute": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the attribute"
    },
    {
      "column_name": "attribute_name",
      "column_description": "attribute name; the attribute",
      "value_description": "commonsense evidence: A superhero's attribute is a characteristic or quality that defines who they are and what they are capable of. This could be a physical trait, such as superhuman strength or the ability to fly, or a personal trait, such as extraordinary intelligence or exceptional bravery."
    }
  ],
  "colour": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the color"
    },
    {
      "column_name": "colour",
      "column_description": "the color of the superhero's skin/eye/hair/etc"
    }
  ],
  "gender": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the gender"
    },
    {
      "column_name": "gender",
      "column_description": "the gender of the superhero"
    }
  ],
  "hero_attribute": [
    {
      "column_name": "hero_id",
      "column_description": "hero id; the id of the hero Maps to superhero(id)"
    },
    {
      "column_name": "attribute_id",
      "column_description": "attribute id; the id of the attribute Maps to attribute(id)"
    },
    {
      "column_name": "attribute_value",
      "column_description": "attribute value; the attribute value",
      "value_description": "commonsense evidence: If a superhero has a higher attribute value on a particular attribute, it means that they are more skilled or powerful in that area compared to other superheroes. For example, if a superhero has a higher attribute value for strength, they may be able to lift heavier objects or deliver more powerful punches than other superheroes."
    }
  ],
  "hero_power": [
    {
      "column_name": "hero_id",
      "column_description": "hero id; the id of the hero Maps to superhero(id)"
    },
    {
      "column_name": "power_id",
      "column_description": "power id; the id of the power Maps to superpower(id)",
      "value_description": "commonsense evidence: In general, a superhero's attributes provide the foundation for their abilities and help to define who they are, while their powers are the specific abilities that they use to fight crime and protect others."
    }
  ],
  "publisher": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the publisher"
    },
    {
      "column_name": "publisher_name",
      "column_description": "the name of the publisher"
    }
  ],
  "race": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the race"
    },
    {
      "column_name": "race",
      "column_description": "the race of the superhero",
      "value_description": "commonsense evidence: In the context of superheroes, a superhero's race would refer to the particular group of people that the superhero belongs to base on these physical characteristics"
    }
  ],
  "superhero": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the superhero"
    },
    {
      "column_name": "superhero_name",
      "column_description": "superhero name; the name of the superhero"
    },
    {
      "column_name": "full_name",
      "column_description": "full name; the full name of the superhero",
      "value_description": "commonsense evidence: The full name of a person typically consists of their given name, also known as their first name or personal name, and their surname, also known as their last name or family name. For example, if someone's given name is John and their surname is Smith, their full name would be John Smith."
    },
    {
      "column_name": "gender_id",
      "column_description": "gender id; the id of the superhero's gender"
    },
    {
      "column_name": "eye_colour_id",
      "column_description": "eye colour id; the id of the superhero's eye color"
    },
    {
      "column_name": "hair_colour_id",
      "column_description": "hair colour id; the id of the superhero's hair color"
    },
    {
      "column_name": "skin_colour_id",
      "column_description": "skin colour id; the id of the superhero's skin color"
    },
    {
      "column_name": "race_id",
      "column_description": "race id; the id of the superhero's race"
    },
    {
      "column_name": "publisher_id",
      "column_description": "publisher id; the id of the publisher"
    },
    {
      "column_name": "alignment_id",
      "column_description": "alignment id; the id of the superhero's alignment"
    },
    {
      "column_name": "height_cm",
      "column_description": "height cm; the height of the superhero",
      "value_description": "commonsense evidence: The unit of height is centimeter. If the height_cm is NULL or 0, it means the height of the superhero is missing."
    },
    {
      "column_name": "weight_kg",
      "column_description": "weight kg; the weight of the superhero",
      "value_description": "commonsense evidence: The unit of weight is kilogram. If the weight_kg is NULL or 0, it means the weight of the superhero is missing."
    }
  ],
  "superpower": [
    {
      "column_name": "id",
      "column_description": "the unique identifier of the superpower"
    },
    {
      "column_name": "power_name",
      "column_description": "power name; the superpower name"
    }
  ]
}